In [ ]:
# pandas

In [1]:
import pandas as pd
import numpy as np
import io # We will use this to simulate file I/O
import os # To clean up created files

In [ ]:
# series
# it is a single column with an index, it can be created from list array or dictionary


pd.Series(['Alice', 30, 'New York'], index=['name', 'age', 'city'])



# Creating a Series from a dictionary
s_dict = pd.Series({'name': 'Alice', 'age': 30, 'city': 'New York'})
print("\n--- Series from dictionary ---")
print(s_dict)
print("\nValue for 'age':", s_dict['age'])

--- Series from dictionary ---
name       Alice
age           30
city    New York
dtype: object

Value for 'age': 30

--- Attributes ---

In [6]:
# Series attributes

print("\n--- Attributes ---")
print("Index:", s_dict.index)
print("Values:", s_dict.values)
print("Data Type:", s_dict.dtype)

--- Attributes ---
Index: Index(['name', 'age', 'city'], dtype='object')
Values: ['Alice' 30 'New York']
Data Type: object

In [ ]:
# Dataframe
# it is a 2D table with rows and columns, it can be created from list of lists, dictionary of lists or 2D array

# columns: the label of the vertical data
# index: the label of the horizontal rows

# Creating a DataFrame from a dictionary of lists (most common)
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary': [70000, 80000, 90000, 100000]
}

df = pd.DataFrame(data)

print("--- DataFrame from Dictionary ---")
print(df)

--- DataFrame from Dictionary ---
      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000
3    David   40      Houston  100000

In [10]:
# Creating a DataFrame with a custom index
df_custom_index = pd.DataFrame(data, index=['emp1', 'emp2', 'emp3', 'emp4'])
print("\n--- DataFrame with Custom Index ---")
print(df_custom_index)

--- DataFrame with Custom Index ---
         Name  Age         City  Salary
emp1    Alice   25     New York   70000
emp2      Bob   30  Los Angeles   80000
emp3  Charlie   35      Chicago   90000
emp4    David   40      Houston  100000

In [11]:
# DataFrame attributes
print("\n--- Attributes ---")
print("Index:", df.index)
print("Columns:", df.columns)
print("Data Types:\n", df.dtypes)
print("Shape (rows, cols):", df.shape)
print("Values (as NumPy array):\n", df.values)

--- Attributes ---
Index: RangeIndex(start=0, stop=4, step=1)
Columns: Index(['Name', 'Age', 'City', 'Salary'], dtype='object')
Data Types:
 Name      object
Age        int64
City      object
Salary     int64
dtype: object
Shape (rows, cols): (4, 4)
Values (as NumPy array):
 [['Alice' 25 'New York' 70000]
 ['Bob' 30 'Los Angeles' 80000]
 ['Charlie' 35 'Chicago' 90000]
 ['David' 40 'Houston' 100000]]

In [12]:
# First, let's create a dummy CSV file to read
csv_data = """id,name,department,salary
101,John,Sales,50000
102,Jane,Marketing,60000
103,Peter,Sales,55000
104,Mary,HR,45000
105,Tom,,70000
106,Lisa,Marketing,
"""

# We use io.StringIO to simulate reading a file from disk
# In real life, you would just use the file path:
# df_csv = pd.read_csv('my_file.csv')

df_csv = pd.read_csv(io.StringIO(csv_data))

print("--- Read from CSV ---")
print(df_csv)

# Common parameters for read_csv:
# sep: The delimiter (e.g., '\t' for tab-separated)
# header: Row number to use as column names (e.g., header=None)
# names: List of column names to use
# index_col: Column to use as the row index
# usecols: List of columns to read
# na_values: Strings to recognize as NaN (e.g., 'Missing', 'N/A')

df_csv_options = pd.read_csv(
    io.StringIO(csv_data),
    index_col='id',            # Use 'id' column as the index
    na_values=['', 'NA']      # Treat empty strings as 'Not a Number'
)
print("\n--- Read from CSV with options ---")
print(df_csv_options)

--- Read from CSV ---
    id   name department   salary
0  101   John      Sales  50000.0
1  102   Jane  Marketing  60000.0
2  103  Peter      Sales  55000.0
3  104   Mary         HR  45000.0
4  105    Tom        NaN  70000.0
5  106   Lisa  Marketing      NaN

--- Read from CSV with options ---
      name department   salary
id
101   John      Sales  50000.0
102   Jane  Marketing  60000.0
103  Peter      Sales  55000.0
104   Mary         HR  45000.0
105    Tom        NaN  70000.0
106   Lisa  Marketing      NaN

In [13]:
# We need to simulate an Excel file. We'll create one, read it, then delete it.
excel_file = 'temp_lab_data.xlsx'
df.to_excel(excel_file, sheet_name='Employees', index=False)

# Read from Excel
# In real life: df_excel = pd.read_excel('my_data.xlsx')
df_excel = pd.read_excel(excel_file)

print("--- Read from Excel ---")
print(df_excel)

# Common parameters for read_excel:
# sheet_name: Name or index of the sheet to read (default is 0)
# header: Row to use as column names
# index_col: Column to use as the index

# Clean up the file we created
os.remove(excel_file)

--- Read from Excel ---
      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000
3    David   40      Houston  100000

In [14]:
# Use the DataFrame from our CSV example
print("--- Original DataFrame ---")
print(df_csv)

# Write to CSV
# df_csv.to_csv('output.csv')

# A very important parameter is index=False
# By default, Pandas will write the index (0, 1, 2...) as a new column.
# We usually don't want this.
df_csv.to_csv('output_no_index.csv', index=False)
print("\n'output_no_index.csv' created (check your file system!)")

# Write to Excel
df_csv.to_excel('output.xlsx', sheet_name='Data', index=False)
print("'output.xlsx' created.")

# Clean up
os.remove('output_no_index.csv')
os.remove('output.xlsx')

--- Original DataFrame ---
    id   name department   salary
0  101   John      Sales  50000.0
1  102   Jane  Marketing  60000.0
2  103  Peter      Sales  55000.0
3  104   Mary         HR  45000.0
4  105    Tom        NaN  70000.0
5  106   Lisa  Marketing      NaN

'output_no_index.csv' created (check your file system!)
'output.xlsx' created.

In [15]:
# Let's use our sample DataFrame 'df' from the beginning
print("--- Original DataFrame ---")
print(df)

--- Original DataFrame ---
      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000
3    David   40      Houston  100000

In [16]:
# Get the first N rows (default 5)
print("--- .head() ---")
print(df.head(2)) # Show first 2 rows

# Get the last N rows (default 5)
print("\n--- .tail() ---")
print(df.tail(2)) # Show last 2 rows

# Get a concise summary of the DataFrame
# This is CRITICAL. It shows:
# 1. Index and Column info
# 2. Non-null counts (how much data is missing)
# 3. Data types (dtypes)
# 4. Memory usage
print("\n--- .info() ---")
df.info()

# Get a statistical summary for numerical columns
# Shows: count, mean, std dev, min, max, and quartiles
print("\n--- .describe() ---")
print(df.describe())

# Get a statistical summary for all columns (including categorical)
print("\n--- .describe(include='all') ---")
print(df.describe(include='all'))

# Get the dimensions (rows, columns)
print("\n--- .shape ---")
print(df.shape)

# Get column names
print("\n--- .columns ---")
print(df.columns)

# Get data types
print("\n--- .dtypes ---")
print(df.dtypes)

# Get unique values in a Series
print("\n--- .unique() (for 'City' column) ---")
print(df['City'].unique())

# Get value counts for a Series
print("\n--- .value_counts() (for 'City' column) ---")
print(df['City'].value_counts())

--- .head() ---
    Name  Age         City  Salary
0  Alice   25     New York   70000
1    Bob   30  Los Angeles   80000

--- .tail() ---
      Name  Age     City  Salary
2  Charlie   35  Chicago   90000
3    David   40  Houston  100000

--- .info() ---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
 3   Salary  4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes

--- .describe() ---
             Age         Salary
count   4.000000       4.000000
mean   32.500000   85000.000000
std     6.454972   12909.944487
min    25.000000   70000.000000
25%    28.750000   77500.000000
50%    32.500000   85000.000000
75%    36.250000   92500.000000
max    40.000000  100000.000000

--- .describe(include='all') ---
         Name        Age      City         Salary
count       4   4.000000         4       4.000000
unique      4        NaN         4            NaN
top     Alice        NaN  New York            NaN
freq        1        NaN         1            NaN
mean      NaN  32.500000       NaN   85000.000000
std       NaN   6.454972       NaN   12909.944487
min       NaN  25.000000       NaN   70000.000000
25%       NaN  28.750000       NaN   77500.000000
50%       NaN  32.500000       NaN   85000.000000
75%       NaN  36.250000       NaN   92500.000000
max       NaN  40.000000       NaN  100000.000000

--- .shape ---
(4, 4)

--- .columns ---
Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

--- .dtypes ---
Name      object
Age        int64
City      object
Salary     int64
dtype: object

--- .unique() (for 'City' column) ---
['New York' 'Los Angeles' 'Chicago' 'Houston']

--- .value_counts() (for 'City' column) ---
City
New York       1
Los Angeles    1
Chicago        1
Houston        1
Name: count, dtype: int64

In [17]:
# Select a single column (returns a Series)
print("--- Select single column 'Name' (as Series) ---")
names = df['Name']
print(names)
print("Type:", type(names))

# Alternative: dot notation (BE CAREFUL)
# - Only works if column name has no spaces/special chars
# - Only works if column name doesn't conflict with a DataFrame method (e.g., 'count')
# - It's generally safer to use bracket notation.
print("\n--- Dot notation 'df.Name' ---")
print(df.Name)

# Select multiple columns (returns a DataFrame)
# Note the double brackets: df[ ['col1', 'col2'] ]
print("\n--- Select multiple columns 'Name' and 'Salary' ---")
sub_df = df[['Name', 'Salary']]
print(sub_df)
print("Type:", type(sub_df))

--- Select single column 'Name' (as Series) ---
0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object
Type: <class 'pandas.core.series.Series'>

--- Dot notation 'df.Name' ---
0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

--- Select multiple columns 'Name' and 'Salary' ---
      Name  Salary
0    Alice   70000
1      Bob   80000
2  Charlie   90000
3    David  100000
Type: <class 'pandas.core.frame.DataFrame'>

In [18]:
# Select rows by slice (like Python lists)
print("--- Select rows 1 and 2 (index 1 up to 3) ---")
print(df[1:3])

--- Select rows 1 and 2 (index 1 up to 3) ---
      Name  Age         City  Salary
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [19]:
print("--- Custom Index DataFrame ---")
print(df_custom_index)

# --- Using .loc[] (Label-based) ---

# Select a single row (returns a Series)
print("\n--- .loc['emp2'] (as Series) ---")
print(df_custom_index.loc['emp2'])

# Select multiple rows (returns a DataFrame)
print("\n--- .loc[['emp1', 'emp3']] ---")
print(df_custom_index.loc[['emp1', 'emp3']])

# Select a range of rows (inclusive!)
# This is a key difference from Python slicing. .loc is INCLUSIVE.
print("\n--- .loc['emp1':'emp3'] (inclusive) ---")
print(df_custom_index.loc['emp1':'emp3'])

# Select rows and columns
print("\n--- .loc['emp2', 'Name'] (single value) ---")
print(df_custom_index.loc['emp2', 'Name'])

print("\n--- .loc[['emp1', 'emp4'], ['Name', 'Salary']] ---")
print(df_custom_index.loc[['emp1', 'emp4'], ['Name', 'Salary']])

# Select all rows for specific columns
print("\n--- .loc[:, ['Name', 'City']] (all rows) ---")
print(df_custom_index.loc[:, ['Name', 'City']])


# --- Using .iloc[] (Integer-position-based) ---
# We'll use the original 'df' with default 0, 1, 2... index
print("\n\n--- Original DataFrame (for .iloc) ---")
print(df)

# Select a single row (index 1)
print("\n--- .iloc[1] (row at position 1) ---")
print(df.iloc[1])

# Select multiple rows
print("\n--- .iloc[[0, 2]] (rows at pos 0 and 2) ---")
print(df.iloc[[0, 2]])

# Select a range of rows (exclusive!)
# This works just like standard Python slicing.
print("\n--- .iloc[0:2] (rows 0 up to 2, exclusive) ---")
print(df.iloc[0:2]) # Rows at pos 0 and 1

# Select rows and columns
print("\n--- .iloc[1, 0] (row 1, col 0) ---")
print(df.iloc[1, 0]) # Bob

print("\n--- .iloc[[0, 3], [0, 2]] (rows 0,3 and cols 0,2) ---")
print(df.iloc[[0, 3], [0, 2]]) # Alice/David, Name/City

# Select all columns for specific rows
print("\n--- .iloc[1:3, :] (rows 1,2, all cols) ---")
print(df.iloc[1:3, :])

--- Custom Index DataFrame ---
         Name  Age         City  Salary
emp1    Alice   25     New York   70000
emp2      Bob   30  Los Angeles   80000
emp3  Charlie   35      Chicago   90000
emp4    David   40      Houston  100000

--- .loc['emp2'] (as Series) ---
Name              Bob
Age                30
City      Los Angeles
Salary          80000
Name: emp2, dtype: object

--- .loc[['emp1', 'emp3']] ---
         Name  Age      City  Salary
emp1    Alice   25  New York   70000
emp3  Charlie   35   Chicago   90000

--- .loc['emp1':'emp3'] (inclusive) ---
         Name  Age         City  Salary
emp1    Alice   25     New York   70000
emp2      Bob   30  Los Angeles   80000
emp3  Charlie   35      Chicago   90000

--- .loc['emp2', 'Name'] (single value) ---
Bob

--- .loc[['emp1', 'emp4'], ['Name', 'Salary']] ---
       Name  Salary
emp1  Alice   70000
emp4  David  100000

--- .loc[:, ['Name', 'City']] (all rows) ---
         Name         City
emp1    Alice     New York
emp2      Bob  Los Angeles
emp3  Charlie      Chicago
emp4    David      Houston


--- Original DataFrame (for .iloc) ---
      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000
3    David   40      Houston  100000

--- .iloc[1] (row at position 1) ---
Name              Bob
Age                30
City      Los Angeles
Salary          80000
Name: 1, dtype: object

--- .iloc[[0, 2]] (rows at pos 0 and 2) ---
      Name  Age      City  Salary
0    Alice   25  New York   70000
2  Charlie   35   Chicago   90000

--- .iloc[0:2] (rows 0 up to 2, exclusive) ---
    Name  Age         City  Salary
0  Alice   25     New York   70000
1    Bob   30  Los Angeles   80000

--- .iloc[1, 0] (row 1, col 0) ---
Bob

--- .iloc[[0, 3], [0, 2]] (rows 0,3 and cols 0,2) ---
    Name      City
0  Alice  New York
3  David   Houston

--- .iloc[1:3, :] (rows 1,2, all cols) ---
      Name  Age         City  Salary
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [20]:
print("--- Original DataFrame ---")
print(df)

# 1. Create a boolean Series
condition = df['Age'] > 30
print("\n--- Boolean Series (Age > 30) ---")
print(condition)

# 2. Pass that Series to the DataFrame
print("\n--- DataFrame where Age > 30 ---")
print(df[df['Age'] > 30])

# You can (and usually will) do this in one line:
print("\n--- DataFrame where Age > 30 (one line) ---")
print(df[df['Age'] > 30])

# More complex conditions
# & = AND
# | = OR
# ~ = NOT
# **IMPORTANT**: You MUST use parentheses for each condition.

# Condition: Age > 30 AND City == 'Chicago'
print("\n--- Age > 30 AND City == 'Chicago' ---")
cond1 = df['Age'] > 30
cond2 = df['City'] == 'Chicago'
print(df[cond1 & cond2])

# Condition: Salary < 80000 OR City == 'New York'
print("\n--- Salary < 80000 OR City == 'New York' ---")
print(df[(df['Salary'] < 80000) | (df['City'] == 'New York')])

# Using .isin() for multiple ORs
print("\n--- City is 'New York' or 'Houston' (using .isin()) ---")
cities = ['New York', 'Houston']
print(df[df['City'].isin(cities)])

# Using .between() for ranges
print("\n--- Age between 30 and 40 (inclusive) ---")
print(df[df['Age'].between(30, 40)])

--- Original DataFrame ---
      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000
3    David   40      Houston  100000

--- Boolean Series (Age > 30) ---
0    False
1    False
2     True
3     True
Name: Age, dtype: bool

--- DataFrame where Age > 30 ---
      Name  Age     City  Salary
2  Charlie   35  Chicago   90000
3    David   40  Houston  100000

--- DataFrame where Age > 30 (one line) ---
      Name  Age     City  Salary
2  Charlie   35  Chicago   90000
3    David   40  Houston  100000

--- Age > 30 AND City == 'Chicago' ---
      Name  Age     City  Salary
2  Charlie   35  Chicago   90000

--- Salary < 80000 OR City == 'New York' ---
    Name  Age      City  Salary
0  Alice   25  New York   70000

--- City is 'New York' or 'Houston' (using .isin()) ---
    Name  Age      City  Salary
0  Alice   25  New York   70000
3  David   40   Houston  100000

--- Age between 30 and 40 (inclusive) ---
      Name  Age         City  Salary
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000
3    David   40      Houston  100000

In [21]:
messy_data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Alice', 'Eve', 'Frank', 'Grace'],
    'Age': [25, 30, 35, 40, 25, 28, 50, 'Thirty'],
    'Salary': [70000, 80000, 90000, 100000, 70000, 65000, None, 85000],
    'Department': ['HR', 'Engineering', 'Sales', 'Engineering', 'HR', 'Sales', None, 'HR']
}
df_messy = pd.DataFrame(messy_data)
print("--- Messy DataFrame ---")
print(df_messy)
df_messy.info()

--- Messy DataFrame ---
      Name     Age    Salary   Department
0    Alice      25   70000.0           HR
1      Bob      30   80000.0  Engineering
2  Charlie      35   90000.0        Sales
3    David      40  100000.0  Engineering
4    Alice      25   70000.0           HR
5      Eve      28   65000.0        Sales
6    Frank      50       NaN         None
7    Grace  Thirty   85000.0           HR
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Age         8 non-null      object
 2   Salary      7 non-null      float64
 3   Department  7 non-null      object
dtypes: float64(1), object(3)
memory usage: 388.0+ bytes

In [22]:
# 1. Detect missing data
print("\n--- Is Null? (Boolean) ---")
print(df_messy.isnull())

print("\n--- Sum of nulls per column ---")
print(df_messy.isnull().sum())

# 2. Drop missing data
# .dropna() removes rows (axis=0) that contain at least one NaN.
print("\n--- Dropping rows with any NaN ---")
print(df_messy.dropna())

# Drop columns with any NaN
print("\n--- Dropping columns with any NaN ---")
print(df_messy.dropna(axis=1))

# Drop rows only if all values are NaN
print("\n--- Dropping rows if ALL are NaN ---")
print(df_messy.dropna(how='all'))

# 3. Fill missing data
# .fillna() is much more common than dropping.
# We often fill with a 0, the mean, the median, or a specific string.

# Fill Salary NaNs with 0
print("\n--- Filling Salary NaN with 0 ---")
print(df_messy['Salary'].fillna(0))

# Fill Salary NaNs with the mean salary
mean_salary = df_messy['Salary'].mean()
print(f"\nMean salary: {mean_salary}")
print("--- Filling Salary NaN with mean ---")
df_filled = df_messy.copy() # Make a copy to not overwrite
df_filled['Salary'] = df_filled['Salary'].fillna(mean_salary)
print(df_filled)

# Fill Department NaNs with a string 'Unassigned'
print("\n--- Filling Department NaN with 'Unassigned' ---")
df_filled['Department'] = df_filled['Department'].fillna('Unassigned')
print(df_filled)

# Forward-fill (ffill): Fills NaN with the value from the preceding row.
# Useful for time-series data.
print("\n--- Forward-fill (ffill) ---")
print(df_messy['Salary'].fillna(method='ffill'))

# Backward-fill (bfill): Fills NaN with the value from the next row.
print("\n--- Backward-fill (bfill) ---")
print(df_messy['Salary'].fillna(method='bfill'))

--- Is Null? (Boolean) ---
    Name    Age  Salary  Department
0  False  False   False       False
1  False  False   False       False
2  False  False   False       False
3  False  False   False       False
4  False  False   False       False
5  False  False   False       False
6  False  False    True        True
7  False  False   False       False

--- Sum of nulls per column ---
Name          0
Age           0
Salary        1
Department    1
dtype: int64

--- Dropping rows with any NaN ---
      Name     Age    Salary   Department
0    Alice      25   70000.0           HR
1      Bob      30   80000.0  Engineering
2  Charlie      35   90000.0        Sales
3    David      40  100000.0  Engineering
4    Alice      25   70000.0           HR
5      Eve      28   65000.0        Sales
7    Grace  Thirty   85000.0           HR

--- Dropping columns with any NaN ---
      Name     Age
0    Alice      25
1      Bob      30
2  Charlie      35
3    David      40
4    Alice      25
5      Eve      28
6    Frank      50
7    Grace  Thirty

--- Dropping rows if ALL are NaN ---
      Name     Age    Salary   Department
0    Alice      25   70000.0           HR
1      Bob      30   80000.0  Engineering
2  Charlie      35   90000.0        Sales
3    David      40  100000.0  Engineering
4    Alice      25   70000.0           HR
5      Eve      28   65000.0        Sales
6    Frank      50       NaN         None
7    Grace  Thirty   85000.0           HR

--- Filling Salary NaN with 0 ---
0     70000.0
1     80000.0
2     90000.0
3    100000.0
4     70000.0
5     65000.0
6         0.0
7     85000.0
Name: Salary, dtype: float64

Mean salary: 80000.0
--- Filling Salary NaN with mean ---
      Name     Age    Salary   Department
0    Alice      25   70000.0           HR
1      Bob      30   80000.0  Engineering
2  Charlie      35   90000.0        Sales
3    David      40  100000.0  Engineering
4    Alice      25   70000.0           HR
5      Eve      28   65000.0        Sales
6    Frank      50   80000.0         None
7    Grace  Thirty   85000.0           HR

--- Filling Department NaN with 'Unassigned' ---
      Name     Age    Salary   Department
0    Alice      25   70000.0           HR
1      Bob      30   80000.0  Engineering
2  Charlie      35   90000.0        Sales
3    David      40  100000.0  Engineering
4    Alice      25   70000.0           HR
5      Eve      28   65000.0        Sales
6    Frank      50   80000.0   Unassigned
7    Grace  Thirty   85000.0           HR

--- Forward-fill (ffill) ---
0     70000.0
1     80000.0
2     90000.0
3    100000.0
4     70000.0
5     65000.0
6     65000.0
7     85000.0
Name: Salary, dtype: float64

--- Backward-fill (bfill) ---
0     70000.0
1     80000.0
2     90000.0
3    100000.0
4     70000.0
5     65000.0
6     85000.0
7     85000.0
Name: Salary, dtype: float64

/var/folders/rc/v7spqyl57gl721yw5q0dhn_00000gn/T/ipykernel_63313/3910145050.py:45: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df_messy['Salary'].fillna(method='ffill'))
/var/folders/rc/v7spqyl57gl721yw5q0dhn_00000gn/T/ipykernel_63313/3910145050.py:49: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(df_messy['Salary'].fillna(method='bfill'))

In [23]:
# 1. Detect duplicates
# .duplicated() returns a boolean Series.
# 'keep=first' (default): marks all but the first occurrence as True.
print("\n--- Detecting duplicates ---")
print(df_messy.duplicated())

# To see the full duplicate row:
print("\n--- Show duplicate rows ---")
print(df_messy[df_messy.duplicated()])

# 2. Drop duplicates
# .drop_duplicates() removes the duplicates.
print("\n--- Dropping duplicates (keeps first) ---")
df_no_dupes = df_messy.drop_duplicates()
print(df_no_dupes)

# Keep the last occurrence instead
print("\n--- Dropping duplicates (keeps last) ---")
print(df_messy.drop_duplicates(keep='last'))

# Drop duplicates based on a subset of columns
print("\n--- Dropping duplicates based on 'Name' column only ---")
print(df_messy.drop_duplicates(subset=['Name']))

--- Detecting duplicates ---
0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
dtype: bool

--- Show duplicate rows ---
    Name Age   Salary Department
4  Alice  25  70000.0         HR

--- Dropping duplicates (keeps first) ---
      Name     Age    Salary   Department
0    Alice      25   70000.0           HR
1      Bob      30   80000.0  Engineering
2  Charlie      35   90000.0        Sales
3    David      40  100000.0  Engineering
5      Eve      28   65000.0        Sales
6    Frank      50       NaN         None
7    Grace  Thirty   85000.0           HR

--- Dropping duplicates (keeps last) ---
      Name     Age    Salary   Department
1      Bob      30   80000.0  Engineering
2  Charlie      35   90000.0        Sales
3    David      40  100000.0  Engineering
4    Alice      25   70000.0           HR
5      Eve      28   65000.0        Sales
6    Frank      50       NaN         None
7    Grace  Thirty   85000.0           HR

--- Dropping duplicates based on 'Name' column only ---
      Name     Age    Salary   Department
0    Alice      25   70000.0           HR
1      Bob      30   80000.0  Engineering
2  Charlie      35   90000.0        Sales
3    David      40  100000.0  Engineering
5      Eve      28   65000.0        Sales
6    Frank      50       NaN         None
7    Grace  Thirty   85000.0           HR

In [24]:
# 1. Fix the bad data
# We can use .replace() or .loc
df_fixed = df_messy.drop_duplicates().copy() # Start from a cleaner slate
print("\n--- Before fixing 'Age' ---")
print(df_fixed)

df_fixed['Age'] = df_fixed['Age'].replace('Thirty', 30)
print("\n--- After replacing 'Thirty' ---")
print(df_fixed)

# 2. Convert the type
# Use .astype() to change the type.
# This will fail if there are NaNs or non-numeric strings.
# We must fill NaNs first (our 'Salary' column is float due to NaN)
df_fixed['Salary'] = df_fixed['Salary'].fillna(0)
df_fixed['Salary'] = df_fixed['Salary'].astype(int)

df_fixed['Age'] = df_fixed['Age'].astype(int)

print("\n--- After .astype() ---")
df_fixed.info()
print(df_fixed)

# A more robust way: pd.to_numeric
# 'errors='coerce'' will turn any un-parseable string into NaN.
df_messy['Age_numeric'] = pd.to_numeric(df_messy['Age'], errors='coerce')
print("\n--- Using pd.to_numeric(errors='coerce') ---")
print(df_messy)
# Now we can fill the NaN
df_messy['Age_numeric'] = df_messy['Age_numeric'].fillna(df_messy['Age_numeric'].mean())
print("\n--- After filling NaN from coercion ---")
print(df_messy)

--- Before fixing 'Age' ---
      Name     Age    Salary   Department
0    Alice      25   70000.0           HR
1      Bob      30   80000.0  Engineering
2  Charlie      35   90000.0        Sales
3    David      40  100000.0  Engineering
5      Eve      28   65000.0        Sales
6    Frank      50       NaN         None
7    Grace  Thirty   85000.0           HR

--- After replacing 'Thirty' ---
      Name  Age    Salary   Department
0    Alice   25   70000.0           HR
1      Bob   30   80000.0  Engineering
2  Charlie   35   90000.0        Sales
3    David   40  100000.0  Engineering
5      Eve   28   65000.0        Sales
6    Frank   50       NaN         None
7    Grace   30   85000.0           HR

--- After .astype() ---
<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 7
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        7 non-null      object
 1   Age         7 non-null      int64
 2   Salary      7 non-null      int64
 3   Department  6 non-null      object
dtypes: int64(2), object(2)
memory usage: 280.0+ bytes
      Name  Age  Salary   Department
0    Alice   25   70000           HR
1      Bob   30   80000  Engineering
2  Charlie   35   90000        Sales
3    David   40  100000  Engineering
5      Eve   28   65000        Sales
6    Frank   50       0         None
7    Grace   30   85000           HR

--- Using pd.to_numeric(errors='coerce') ---
      Name     Age    Salary   Department  Age_numeric
0    Alice      25   70000.0           HR         25.0
1      Bob      30   80000.0  Engineering         30.0
2  Charlie      35   90000.0        Sales         35.0
3    David      40  100000.0  Engineering         40.0
4    Alice      25   70000.0           HR         25.0
5      Eve      28   65000.0        Sales         28.0
6    Frank      50       NaN         None         50.0
7    Grace  Thirty   85000.0           HR          NaN

--- After filling NaN from coercion ---
      Name     Age    Salary   Department  Age_numeric
0    Alice      25   70000.0           HR    25.000000
1      Bob      30   80000.0  Engineering    30.000000
2  Charlie      35   90000.0        Sales    35.000000
3    David      40  100000.0  Engineering    40.000000
4    Alice      25   70000.0           HR    25.000000
5      Eve      28   65000.0        Sales    28.000000
6    Frank      50       NaN         None    50.000000
7    Grace  Thirty   85000.0           HR    33.285714

/var/folders/rc/v7spqyl57gl721yw5q0dhn_00000gn/T/ipykernel_63313/1169852087.py:7: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_fixed['Age'] = df_fixed['Age'].replace('Thirty', 30)

In [25]:
print("\n--- Original DataFrame ---")
print(df_fixed)

# Use .rename() with a dictionary
df_renamed = df_fixed.rename(columns={
    'Name': 'Employee Name',
    'Salary': 'Annual Salary (USD)'
})

print("\n--- After renaming ---")
print(df_renamed)

# Note: .rename() (like most pandas methods) returns a NEW DataFrame.
# To change the original, use inplace=True (but this is discouraged)
# df_fixed.rename(columns={'Name': 'Employee Name'}, inplace=True)

# A common trick: rename all columns at once to be lower/snake_case
df_renamed.columns = df_renamed.columns.str.lower().str.replace(' ', '_').str.replace('(usd)', '', regex=False)
print("\n--- Columns cleaned (snake_case) ---")
print(df_renamed.columns)

--- Original DataFrame ---
      Name  Age  Salary   Department
0    Alice   25   70000           HR
1      Bob   30   80000  Engineering
2  Charlie   35   90000        Sales
3    David   40  100000  Engineering
5      Eve   28   65000        Sales
6    Frank   50       0         None
7    Grace   30   85000           HR

--- After renaming ---
  Employee Name  Age  Annual Salary (USD)   Department
0         Alice   25                70000           HR
1           Bob   30                80000  Engineering
2       Charlie   35                90000        Sales
3         David   40               100000  Engineering
5           Eve   28                65000        Sales
6         Frank   50                    0         None
7         Grace   30                85000           HR

--- Columns cleaned (snake_case) ---
Index(['employee_name', 'age', 'annual_salary_', 'department'], dtype='object')

In [26]:
# Let's use our clean DataFrame 'df'
print("--- Original DataFrame ---")
print(df)

--- Original DataFrame ---
      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000
3    David   40      Houston  100000

In [27]:
# Add a new column with a constant value
df['Company'] = 'TechCorp'
print("\n--- Added 'Company' column ---")
print(df)

# Add a new column based on existing columns (Vectorization)
# This is FAST. Pandas/NumPy do the loop in C.
df['Salary_After_5%_Raise'] = df['Salary'] * 1.05
print("\n--- Added 'Salary_After_5%_Raise' column ---")
print(df)

# Modify an existing column
df['Salary'] = df['Salary'] * 1.10
print("\n--- Modified 'Salary' (10% raise) ---")
print(df)

# Dropping columns
# Use .drop() with axis=1
df = df.drop('Company', axis=1)
print("\n--- Dropped 'Company' column ---")
print(df)

--- Added 'Company' column ---
      Name  Age         City  Salary   Company
0    Alice   25     New York   70000  TechCorp
1      Bob   30  Los Angeles   80000  TechCorp
2  Charlie   35      Chicago   90000  TechCorp
3    David   40      Houston  100000  TechCorp

--- Added 'Salary_After_5%_Raise' column ---
      Name  Age         City  Salary   Company  Salary_After_5%_Raise
0    Alice   25     New York   70000  TechCorp                73500.0
1      Bob   30  Los Angeles   80000  TechCorp                84000.0
2  Charlie   35      Chicago   90000  TechCorp                94500.0
3    David   40      Houston  100000  TechCorp               105000.0

--- Modified 'Salary' (10% raise) ---
      Name  Age         City    Salary   Company  Salary_After_5%_Raise
0    Alice   25     New York   77000.0  TechCorp                73500.0
1      Bob   30  Los Angeles   88000.0  TechCorp                84000.0
2  Charlie   35      Chicago   99000.0  TechCorp                94500.0
3    David   40      Houston  110000.0  TechCorp               105000.0

--- Dropped 'Company' column ---
      Name  Age         City    Salary  Salary_After_5%_Raise
0    Alice   25     New York   77000.0                73500.0
1      Bob   30  Los Angeles   88000.0                84000.0
2  Charlie   35      Chicago   99000.0                94500.0
3    David   40      Houston  110000.0               105000.0

In [28]:
# --- .map() ---
# Let's map City names to Regions
city_region_map = {
    'New York': 'East',
    'Los Angeles': 'West',
    'Chicago': 'Midwest',
    'Houston': 'South'
}

df['Region'] = df['City'].map(city_region_map)
print("\n--- Added 'Region' using .map() ---")
print(df)


# --- .apply() on a Series ---
# Use a custom function or a lambda function
def get_name_length(name):
    return len(name)

df['Name_Length'] = df['Name'].apply(get_name_length)
print("\n--- Added 'Name_Length' using .apply() on Series ---")
print(df)

# Same thing with a lambda function (more common)
df['Salary_Category'] = df['Salary'].apply(
    lambda x: 'High' if x > 90000 else 'Low'
)
print("\n--- Added 'Salary_Category' using lambda ---")
print(df)


# --- .apply() on a DataFrame ---
# By default, axis=0 (applies function to each COLUMN)
print("\n--- .apply() on DataFrame (axis=0) ---")
# This is like calling .mean() on all numeric columns
# Fix: Select only numeric columns before applying np.mean
print(df.select_dtypes(include=np.number).apply(np.mean, axis=0))

# axis=1 (applies function to each ROW)
# The function receives the entire row as a Series
def get_age_salary_ratio(row):
    # 'row' is a Series where index is column names
    return row['Salary'] / row['Age']

df['Age_Salary_Ratio'] = df.apply(get_age_salary_ratio, axis=1)
print("\n--- Added 'Age_Salary_Ratio' using .apply(axis=1) ---")
print(df)

--- Added 'Region' using .map() ---
      Name  Age         City    Salary  Salary_After_5%_Raise   Region
0    Alice   25     New York   77000.0                73500.0     East
1      Bob   30  Los Angeles   88000.0                84000.0     West
2  Charlie   35      Chicago   99000.0                94500.0  Midwest
3    David   40      Houston  110000.0               105000.0    South

--- Added 'Name_Length' using .apply() on Series ---
      Name  Age         City    Salary  Salary_After_5%_Raise   Region  \
0    Alice   25     New York   77000.0                73500.0     East
1      Bob   30  Los Angeles   88000.0                84000.0     West
2  Charlie   35      Chicago   99000.0                94500.0  Midwest
3    David   40      Houston  110000.0               105000.0    South

   Name_Length
0            5
1            3
2            7
3            5

--- Added 'Salary_Category' using lambda ---
      Name  Age         City    Salary  Salary_After_5%_Raise   Region  \
0    Alice   25     New York   77000.0                73500.0     East
1      Bob   30  Los Angeles   88000.0                84000.0     West
2  Charlie   35      Chicago   99000.0                94500.0  Midwest
3    David   40      Houston  110000.0               105000.0    South

   Name_Length Salary_Category
0            5             Low
1            3             Low
2            7            High
3            5            High

--- .apply() on DataFrame (axis=0) ---
Age                         32.5
Salary                   93500.0
Salary_After_5%_Raise    89250.0
Name_Length                  5.0
dtype: float64

--- Added 'Age_Salary_Ratio' using .apply(axis=1) ---
      Name  Age         City    Salary  Salary_After_5%_Raise   Region  \
0    Alice   25     New York   77000.0                73500.0     East
1      Bob   30  Los Angeles   88000.0                84000.0     West
2  Charlie   35      Chicago   99000.0                94500.0  Midwest
3    David   40      Houston  110000.0               105000.0    South

   Name_Length Salary_Category  Age_Salary_Ratio
0            5             Low       3080.000000
1            3             Low       2933.333333
2            7            High       2828.571429
3            5            High       2750.000000

In [29]:
print("\n--- Using .str accessor ---")
print("Lower case names: ", df['Name'].str.lower())
print("Does name contain 'li'? ", df['Name'].str.contains('li'))
print("Replace 'e' with 'X': ", df['Name'].str.replace('e', 'X'))

# Example: Split and extract
df_split = pd.DataFrame({'FullName': ['Doe, John', 'Smith, Jane', 'Brown, Jim']})
print("\n--- Splitting a column ---")
print(df_split)
split_names = df_split['FullName'].str.split(', ', expand=True)
split_names.columns = ['LastName', 'FirstName']
print(split_names)

# We can join this back to the original
df_split = pd.concat([df_split, split_names], axis=1)
print("\n--- After splitting and joining ---")
print(df_split)

--- Using .str accessor ---
Lower case names:  0      alice
1        bob
2    charlie
3      david
Name: Name, dtype: object
Does name contain 'li'?  0     True
1    False
2     True
3    False
Name: Name, dtype: bool
Replace 'e' with 'X':  0      AlicX
1        Bob
2    CharliX
3      David
Name: Name, dtype: object

--- Splitting a column ---
      FullName
0    Doe, John
1  Smith, Jane
2   Brown, Jim
  LastName FirstName
0      Doe      John
1    Smith      Jane
2    Brown       Jim

--- After splitting and joining ---
      FullName LastName FirstName
0    Doe, John      Doe      John
1  Smith, Jane    Smith      Jane
2   Brown, Jim    Brown       Jim

In [30]:
data_grouped = {
    'Department': ['Sales', 'Engineering', 'Sales', 'Marketing', 'Engineering', 'Sales', 'HR'],
    'Name': ['John', 'Jane', 'Peter', 'Mary', 'Tom', 'Lisa', 'Sue'],
    'Salary': [50000, 90000, 55000, 60000, 95000, 70000, 45000],
    'Years': [3, 5, 4, 2, 8, 6, 1]
}
df_group = pd.DataFrame(data_grouped)
print("--- Grouping DataFrame ---")
print(df_group)

--- Grouping DataFrame ---
    Department   Name  Salary  Years
0        Sales   John   50000      3
1  Engineering   Jane   90000      5
2        Sales  Peter   55000      4
3    Marketing   Mary   60000      2
4  Engineering    Tom   95000      8
5        Sales   Lisa   70000      6
6           HR    Sue   45000      1

In [31]:
# Create a groupby object
# This object is "lazy" - it hasn't computed anything yet.
dept_group = df_group.groupby('Department')
print("\n--- GroupBy Object ---")
print(dept_group)

# Now, we apply an aggregation
print("\n--- Mean salary by department ---")
print(dept_group['Salary'].mean())

print("\n--- Total salary by department ---")
print(dept_group['Salary'].sum())

print("\n--- Count of employees by department ---")
# .count() counts non-NaN values
# .size() counts total rows (including NaN)
print(dept_group['Name'].count())
# or
print(dept_group.size())

# Get a quick summary
print("\n--- .describe() by department ---")
print(dept_group['Salary'].describe())

--- GroupBy Object ---
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x11554f4d0>

--- Mean salary by department ---
Department
Engineering    92500.000000
HR             45000.000000
Marketing      60000.000000
Sales          58333.333333
Name: Salary, dtype: float64

--- Total salary by department ---
Department
Engineering    185000
HR              45000
Marketing       60000
Sales          175000
Name: Salary, dtype: int64

--- Count of employees by department ---
Department
Engineering    2
HR             1
Marketing      1
Sales          3
Name: Name, dtype: int64
Department
Engineering    2
HR             1
Marketing      1
Sales          3
dtype: int64

--- .describe() by department ---
             count          mean           std      min      25%      50%  \
Department
Engineering    2.0  92500.000000   3535.533906  90000.0  91250.0  92500.0
HR             1.0  45000.000000           NaN  45000.0  45000.0  45000.0
Marketing      1.0  60000.000000           NaN  60000.0  60000.0  60000.0
Sales          3.0  58333.333333  10408.329997  50000.0  52500.0  55000.0

                 75%      max
Department
Engineering  93750.0  95000.0
HR           45000.0  45000.0
Marketing    60000.0  60000.0
Sales        62500.0  70000.0

In [32]:
# Apply multiple aggregations at once
print("\n--- Multiple aggregations on Salary ---")
print(dept_group['Salary'].agg(['sum', 'mean', 'std', 'count']))

# Apply different aggregations to different columns
# We pass a dictionary
aggregations = {
    'Salary': 'mean',
    'Years': ['mean', 'max']
}
print("\n--- Different aggregations for different columns ---")
print(dept_group.agg(aggregations))

# You can even rename the output columns
# The key should be the NEW column name, and the value is (original_column, aggregation)
aggregations_named = {
    'Mean Salary': ('Salary', 'mean'),
    'Max Experience': ('Years', 'max')
}
print("\n--- Named aggregations ---")
print(dept_group.agg(**aggregations_named))

--- Multiple aggregations on Salary ---
                sum          mean           std  count
Department
Engineering  185000  92500.000000   3535.533906      2
HR            45000  45000.000000           NaN      1
Marketing     60000  60000.000000           NaN      1
Sales        175000  58333.333333  10408.329997      3

--- Different aggregations for different columns ---
                   Salary     Years
                     mean      mean max
Department
Engineering  92500.000000  6.500000   8
HR           45000.000000  1.000000   1
Marketing    60000.000000  2.000000   2
Sales        58333.333333  4.333333   6

--- Named aggregations ---
              Mean Salary  Max Experience
Department
Engineering  92500.000000               8
HR           45000.000000               1
Marketing    60000.000000               2
Sales        58333.333333               6

In [33]:
# Let's add another categorical column
df_group['Location'] = ['USA', 'CAN', 'USA', 'USA', 'CAN', 'USA', 'CAN']
print("\n--- DataFrame with Location ---")
print(df_group)

# Group by Department, then Location
multi_group = df_group.groupby(['Department', 'Location'])

print("\n--- Mean salary by Dept and Location ---")
print(multi_group['Salary'].mean())

# This results in a Series with a MultiIndex.
# To make it a flat DataFrame, use as_index=False
print("\n--- Same, but with as_index=False ---")
print(df_group.groupby(['Department', 'Location'], as_index=False)['Salary'].mean())

--- DataFrame with Location ---
    Department   Name  Salary  Years Location
0        Sales   John   50000      3      USA
1  Engineering   Jane   90000      5      CAN
2        Sales  Peter   55000      4      USA
3    Marketing   Mary   60000      2      USA
4  Engineering    Tom   95000      8      CAN
5        Sales   Lisa   70000      6      USA
6           HR    Sue   45000      1      CAN

--- Mean salary by Dept and Location ---
Department   Location
Engineering  CAN         92500.000000
HR           CAN         45000.000000
Marketing    USA         60000.000000
Sales        USA         58333.333333
Name: Salary, dtype: float64

--- Same, but with as_index=False ---
    Department Location        Salary
0  Engineering      CAN  92500.000000
1           HR      CAN  45000.000000
2    Marketing      USA  60000.000000
3        Sales      USA  58333.333333

In [34]:
df1 = pd.DataFrame({
    'id': ['A01', 'A02', 'A03', 'A04'],
    'Name': ['Alice', 'Bob', 'Charlie', 'David']
})

df2 = pd.DataFrame({
    'id': ['A05', 'A06', 'A07'],
    'Name': ['Eve', 'Frank', 'Grace']
})

df3_info = pd.DataFrame({
    'id': ['A01', 'A02', 'A03', 'A04'],
    'Salary': [70000, 80000, 90000, 100000]
})

df4_dept = pd.DataFrame({
    'id': ['A01', 'A02', 'A03', 'A05'], # Note: A04 missing, A05 added
    'Department': ['HR', 'Eng', 'Sales', 'Eng']
})

print("--- df1 --- \n", df1)
print("\n--- df2 --- \n", df2)
print("\n--- df3_info --- \n", df3_info)
print("\n--- df4_dept --- \n", df4_dept)

--- df1 ---
     id     Name
0  A01    Alice
1  A02      Bob
2  A03  Charlie
3  A04    David

--- df2 ---
     id   Name
0  A05    Eve
1  A06  Frank
2  A07  Grace

--- df3_info ---
     id  Salary
0  A01   70000
1  A02   80000
2  A03   90000
3  A04  100000

--- df4_dept ---
     id Department
0  A01         HR
1  A02        Eng
2  A03      Sales
3  A05        Eng

In [35]:
# Stack df1 on top of df2 (axis=0, default)
print("\n--- Concatenating rows (axis=0) ---")
df_all_rows = pd.concat([df1, df2])
print(df_all_rows)

# Note the index is preserved (0,1,2,3, 0,1,2). This is usually bad.
print("\n--- Concatenating rows (resetting index) ---")
df_all_rows = pd.concat([df1, df2], ignore_index=True)
print(df_all_rows)

# Stack side-by-side (axis=1)
# This joins on the index.
print("\n--- Concatenating columns (axis=1) ---")
df_side_by_side = pd.concat([df1, df3_info], axis=1)
print(df_side_by_side)
# This is "dumb" - it just puts them together. Notice the duplicate 'id' column.

--- Concatenating rows (axis=0) ---
    id     Name
0  A01    Alice
1  A02      Bob
2  A03  Charlie
3  A04    David
0  A05      Eve
1  A06    Frank
2  A07    Grace

--- Concatenating rows (resetting index) ---
    id     Name
0  A01    Alice
1  A02      Bob
2  A03  Charlie
3  A04    David
4  A05      Eve
5  A06    Frank
6  A07    Grace

--- Concatenating columns (axis=1) ---
    id     Name   id  Salary
0  A01    Alice  A01   70000
1  A02      Bob  A02   80000
2  A03  Charlie  A03   90000
3  A04    David  A04  100000

In [36]:
# Inner Join (default)
# Keeps only the rows where the key ('id') exists in BOTH DataFrames.
print("\n--- Inner Merge (df1 and df4_dept) ---")
# A04 is in df1 but not df4, A05 is in df4 but not df1
# So, only A01, A02, A03 will be in the result.
inner_merge = pd.merge(df1, df4_dept, on='id', how='inner')
print(inner_merge)

# Left Join
# Keeps all rows from the "left" DataFrame (df1) and matches from the "right" (df4).
print("\n--- Left Merge (df1 and df4_dept) ---")
# A04 will be kept, but its 'Department' will be NaN.
left_merge = pd.merge(df1, df4_dept, on='id', how='left')
print(left_merge)

# Right Join
# Keeps all rows from the "right" DataFrame (df4) and matches from "left" (df1).
print("\n--- Right Merge (df1 and df4_dept) ---")
# A05 will be kept, but its 'Name' will be NaN.
right_merge = pd.merge(df1, df4_dept, on='id', how='right')
print(right_merge)

# Outer Join
# Keeps all rows from BOTH DataFrames. Fills missing with NaN.
print("\n--- Outer Merge (df1 and df4_dept) ---")
# Will contain A01, A02, A03, A04, A05.
outer_merge = pd.merge(df1, df4_dept, on='id', how='outer')
print(outer_merge)

# Merging on different column names
df5_data = pd.DataFrame({
    'employee_id': ['A01', 'A02'],
    'Phone': ['555-1234', '555-5678']
})
print("\n--- Merging on different key names ---")
print(pd.merge(df1, df5_data, left_on='id', right_on='employee_id'))

--- Inner Merge (df1 and df4_dept) ---
    id     Name Department
0  A01    Alice         HR
1  A02      Bob        Eng
2  A03  Charlie      Sales

--- Left Merge (df1 and df4_dept) ---
    id     Name Department
0  A01    Alice         HR
1  A02      Bob        Eng
2  A03  Charlie      Sales
3  A04    David        NaN

--- Right Merge (df1 and df4_dept) ---
    id     Name Department
0  A01    Alice         HR
1  A02      Bob        Eng
2  A03  Charlie      Sales
3  A05      NaN        Eng

--- Outer Merge (df1 and df4_dept) ---
    id     Name Department
0  A01    Alice         HR
1  A02      Bob        Eng
2  A03  Charlie      Sales
3  A04    David        NaN
4  A05      NaN        Eng

--- Merging on different key names ---
    id   Name employee_id     Phone
0  A01  Alice         A01  555-1234
1  A02    Bob         A02  555-5678

In [37]:
# Let's set 'id' as the index for df1 and df3
df1_indexed = df1.set_index('id')
df3_indexed = df3_info.set_index('id')

print("\n--- df1 (indexed) ---\n", df1_indexed)
print("\n--- df3 (indexed) ---\n", df3_indexed)

# Now we can .join() them. Default is a left join.
print("\n--- Joining on index ---")
print(df1_indexed.join(df3_indexed))

--- df1 (indexed) ---
         Name
id
A01    Alice
A02      Bob
A03  Charlie
A04    David

--- df3 (indexed) ---
      Salary
id
A01   70000
A02   80000
A03   90000
A04  100000

--- Joining on index ---
        Name  Salary
id
A01    Alice   70000
A02      Bob   80000
A03  Charlie   90000
A04    David  100000

In [38]:
# Let's use our 'df_group' data
print("--- Grouping DataFrame ---")
print(df_group)

# Let's find the average Salary for each Department and Location.
# We could use a groupby:
print("\n--- Groupby result ---")
print(df_group.groupby(['Department', 'Location'])['Salary'].mean())

# Or we can use a pivot_table:
# index = rows
# columns = columns
# values = what to aggregate
# aggfunc = how to aggregate (default is mean)
print("\n--- Pivot Table result ---")
pivot = pd.pivot_table(
    df_group,
    values='Salary',
    index='Department',
    columns='Location',
    aggfunc='mean'
)
print(pivot)

# We can fill NaNs and add margins (totals)
print("\n--- Pivot Table with fill_value and margins ---")
pivot_full = pd.pivot_table(
    df_group,
    values='Salary',
    index='Department',
    columns='Location',
    aggfunc='mean',
    fill_value=0,   # Fill missing cells with 0
    margins=True,   # Add 'All' (total) row/column
    margins_name='Total_Avg'
)
print(pivot_full)

--- Grouping DataFrame ---
    Department   Name  Salary  Years Location
0        Sales   John   50000      3      USA
1  Engineering   Jane   90000      5      CAN
2        Sales  Peter   55000      4      USA
3    Marketing   Mary   60000      2      USA
4  Engineering    Tom   95000      8      CAN
5        Sales   Lisa   70000      6      USA
6           HR    Sue   45000      1      CAN

--- Groupby result ---
Department   Location
Engineering  CAN         92500.000000
HR           CAN         45000.000000
Marketing    USA         60000.000000
Sales        USA         58333.333333
Name: Salary, dtype: float64

--- Pivot Table result ---
Location         CAN           USA
Department
Engineering  92500.0           NaN
HR           45000.0           NaN
Marketing        NaN  60000.000000
Sales            NaN  58333.333333

--- Pivot Table with fill_value and margins ---
Location              CAN           USA     Total_Avg
Department
Engineering  92500.000000      0.000000  92500.000000
HR           45000.000000      0.000000  45000.000000
Marketing        0.000000  60000.000000  60000.000000
Sales            0.000000  58333.333333  58333.333333
Total_Avg    76666.666667  58750.000000  66428.571429

In [39]:
# Let's use our pivot table, which has a MultiIndex if we groupby
s = df_group.groupby(['Department', 'Location'])['Salary'].mean()
print("\n--- Original MultiIndex Series ---")
print(s)

# --- Unstack ---
# .unstack() moves the *innermost* index level (Location) to columns.
print("\n--- .unstack() ---")
print(s.unstack())

# --- Stack ---
# Let's use the 'pivot' DataFrame, which is "wide"
print("\n--- Original 'pivot' DataFrame ---")
print(pivot)

# .stack() moves the *column* level (Location) to be the new *innermost* index.
print("\n--- .stack() ---")
print(pivot.stack())

--- Original MultiIndex Series ---
Department   Location
Engineering  CAN         92500.000000
HR           CAN         45000.000000
Marketing    USA         60000.000000
Sales        USA         58333.333333
Name: Salary, dtype: float64

--- .unstack() ---
Location         CAN           USA
Department
Engineering  92500.0           NaN
HR           45000.0           NaN
Marketing        NaN  60000.000000
Sales            NaN  58333.333333

--- Original 'pivot' DataFrame ---
Location         CAN           USA
Department
Engineering  92500.0           NaN
HR           45000.0           NaN
Marketing        NaN  60000.000000
Sales            NaN  58333.333333

--- .stack() ---
Department   Location
Engineering  CAN         92500.000000
HR           CAN         45000.000000
Marketing    USA         60000.000000
Sales        USA         58333.333333
dtype: float64

In [40]:
# Convert a column of strings to datetime objects
df_time = pd.DataFrame({'date_str': ['2025-01-01', '2025-01-05', '2025-01-10', '2025-01-15'],
                        'sales': [100, 150, 120, 200]})
print("--- Before conversion ---")
df_time.info()

df_time['date'] = pd.to_datetime(df_time['date_str'])
print("\n--- After pd.to_datetime() ---")
df_time.info()
print(df_time)

# We can now extract components
df_time['day_of_week'] = df_time['date'].dt.day_name()
df_time['month'] = df_time['date'].dt.month
print("\n--- Extracted components ---")
print(df_time)

# Create a date range
# 'D' = Day, 'M' = Month End, 'MS' = Month Start, 'h' = hour
print("\n--- pd.date_range() ---")
date_index = pd.date_range(start='2025-01-01', periods=10, freq='D')
print(date_index)

--- Before conversion ---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date_str  4 non-null      object
 1   sales     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

--- After pd.to_datetime() ---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date_str  4 non-null      object
 1   sales     4 non-null      int64
 2   date      4 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 228.0+ bytes
     date_str  sales       date
0  2025-01-01    100 2025-01-01
1  2025-01-05    150 2025-01-05
2  2025-01-10    120 2025-01-10
3  2025-01-15    200 2025-01-15

--- Extracted components ---
     date_str  sales       date day_of_week  month
0  2025-01-01    100 2025-01-01   Wednesday      1
1  2025-01-05    150 2025-01-05      Sunday      1
2  2025-01-10    120 2025-01-10      Friday      1
3  2025-01-15    200 2025-01-15   Wednesday      1

--- pd.date_range() ---
DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06', '2025-01-07', '2025-01-08',
               '2025-01-09', '2025-01-10'],
              dtype='datetime64[ns]', freq='D')

In [41]:
# Create a sample time series DataFrame
ts_index = pd.date_range(start='2025-01-01', periods=100, freq='D')
data = np.random.randint(50, 100, size=100)
ts_df = pd.DataFrame({'data': data}, index=ts_index)
print("\n--- Time Series DataFrame (first 5 rows) ---")
print(ts_df.head())

# Selection and slicing is now based on dates
print("\n--- Select '2025-01-05' ---")
print(ts_df.loc['2025-01-05'])

print("\n--- Slice for a week ---")
print(ts_df.loc['2025-01-10':'2025-01-17'])

print("\n--- Slice for an entire month ---")
print(ts_df.loc['2025-02']) # Selects all of February

--- Time Series DataFrame (first 5 rows) ---
            data
2025-01-01    82
2025-01-02    88
2025-01-03    89
2025-01-04    70
2025-01-05    74

--- Select '2025-01-05' ---
data    74
Name: 2025-01-05 00:00:00, dtype: int64

--- Slice for a week ---
            data
2025-01-10    85
2025-01-11    59
2025-01-12    60
2025-01-13    96
2025-01-14    66
2025-01-15    96
2025-01-16    54
2025-01-17    98

--- Slice for an entire month ---
            data
2025-02-01    78
2025-02-02    89
2025-02-03    54
2025-02-04    98
2025-02-05    55
2025-02-06    51
2025-02-07    71
2025-02-08    89
2025-02-09    55
2025-02-10    73
2025-02-11    96
2025-02-12    90
2025-02-13    83
2025-02-14    96
2025-02-15    92
2025-02-16    87
2025-02-17    70
2025-02-18    78
2025-02-19    59
2025-02-20    71
2025-02-21    55
2025-02-22    97
2025-02-23    54
2025-02-24    98
2025-02-25    86
2025-02-26    91
2025-02-27    80
2025-02-28    60

In [42]:
# Downsample: Get the total (sum) sales per week ('W')
print("\n--- Downsampling: Weekly Sum ---")
print(ts_df.resample('W').sum())

# Downsample: Get the average (mean) sales per month ('M')
print("\n--- Downsampling: Monthly Mean ---")
print(ts_df.resample('M').mean())

# Upsampling: From Daily ('D') to 12-hour ('12h')
# This creates a lot of NaNs.
print("\n--- Upsampling: Daily to 12-hour ---")
print(ts_df.resample('12h').mean().head(10)) # .mean() is arbitrary here

# We can fill the NaNs
print("\n--- Upsampling with ffill ---")
print(ts_df.resample('12h').ffill().head(10))

--- Downsampling: Weekly Sum ---
            data
2025-01-05   403
2025-01-12   508
2025-01-19   544
2025-01-26   559
2025-02-02   552
2025-02-09   473
2025-02-16   617
2025-02-23   484
2025-03-02   576
2025-03-09   553
2025-03-16   529
2025-03-23   583
2025-03-30   512
2025-04-06   537
2025-04-13   347

--- Downsampling: Monthly Mean ---
                 data
2025-01-31  77.387097
2025-02-28  77.000000
2025-03-31  77.935484
2025-04-30  80.600000

--- Upsampling: Daily to 12-hour ---
                     data
2025-01-01 00:00:00  82.0
2025-01-01 12:00:00   NaN
2025-01-02 00:00:00  88.0
2025-01-02 12:00:00   NaN
2025-01-03 00:00:00  89.0
2025-01-03 12:00:00   NaN
2025-01-04 00:00:00  70.0
2025-01-04 12:00:00   NaN
2025-01-05 00:00:00  74.0
2025-01-05 12:00:00   NaN

--- Upsampling with ffill ---
                     data
2025-01-01 00:00:00    82
2025-01-01 12:00:00    82
2025-01-02 00:00:00    88
2025-01-02 12:00:00    88
2025-01-03 00:00:00    89
2025-01-03 12:00:00    89
2025-01-04 00:00:00    70
2025-01-04 12:00:00    70
2025-01-05 00:00:00    74
2025-01-05 12:00:00    74

/var/folders/rc/v7spqyl57gl721yw5q0dhn_00000gn/T/ipykernel_63313/382181707.py:7: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  print(ts_df.resample('M').mean())